# SharedPosition Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BasePoint..::..SharedPosition Property
BasePoint Class See Also
---
Shared position of the BasePoint based on the active ProjectLocation of its belonging Document. To get the shared position under other ProjectLocations, please use ProjectLocation.GetProjectPosition(BasePoint.Position).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019.2
# Syntax
C#
---
```text
public XYZ SharedPosition { get; internal set; }
```

Visual Basic
---
```text
Public Property SharedPosition As XYZ
	Get
	Friend Set
```

Visual C++
---
```text
public:
property XYZ^ SharedPosition {
	XYZ^ get ();
	internal: void set (XYZ^ value);
}
```

# See Also
BasePoint Class
Autodesk.Revit.DB Namespace